{"intents":[
    {
        "tag": "saludo",
        "patterns": ["hola", "que tal", "como estas", "que onda", "buenas", "saludos"],
        "responses": ["Hola!", "Buenas", "Como estas?"]
    },
    {
        "tag": "funcion",
        "patterns": ["cual es tu funcion",
        "cual es tu funcion",
        "cuál es tu objetivo",
        "para qué sirves",
        "qué función tienes",
        "qué objetivo tienes",
        "qué propósito tienes",
        "qué haces aquí",
        "cuál es tu rol",
        "qué función desempeñas",
        "qué tarea realizas",
        "qué fin persigues"],
        "responses": [
            "Mi función es ser un chatbot diseñado para responder dudas sobre League of Legends.",
            "Soy un chatbot creado con el propósito de resolver consultas relacionadas con League of Legends.",
            "Estoy aquí para ayudarte con cualquier pregunta que tengas sobre League of Legends.",
            "Mi objetivo es proporcionar información y respuestas a las preguntas sobre League of Legends.",
            "Soy un chatbot especializado en responder consultas relacionadas con League of Legends.",
            "Responder tus dudas y preguntas sobre League of Legends es mi propósito principal."
        ]
    },
    {
        "tag": "agradecimiento",
        "patterns": ["gracias",
        "muchas gracias",
        "te agradezco",
        "agradecido",
        "gracias de antemano",
        "mil gracias"],
        "responses": ["¡De nada!",
        "¡Con gusto!",
        "¡Para servirte!",
        "¡No hay de qué!",
        "¡Ningún problema!",
        "¡Estoy aquí para ayudar!",
        "¡Claro que sí!",
        "¡Sin problema!"]
    },
    {
        "tag": "league_of_legends",
        "patterns": ["que es league of legends", "podrias explicarme que es league of legends", "a que te referis con league of legends"],
        "responses": ["League of Legends es un juego multijugador en línea desarrollado por Riot Games.", "League of Legends, también conocido como LoL, es un popular juego en línea desarrollado por Riot Games."]
    },
    {
        "tag": "consiste",
        "patterns": ["como funciona league of legends", "en que consiste league of legends", "como es el juego del league of legends", "explícame cómo funciona league of legends"],
        "responses": ["League of Legends es un juego de estrategia multijugador en línea donde los jugadores controlan un campeón único con habilidades especiales en una batalla frenética. Durante una partida, los campeones ganan experiencia al eliminar enemigos y adquieren oro para comprar elementos que aumenten su poder. Con más de 150 campeones disponibles, cada partida es única y desafiante, ya que los jugadores deben adaptarse a las estrategias en constante cambio de sus oponentes.",
        "En League of Legends, los jugadores se sumergen en emocionantes combates de arena, controlando un campeón con habilidades únicas mientras luchan por la supremacía en el campo de batalla. Con más de 150 campeones para elegir, cada partida ofrece una experiencia completamente diferente. Los jugadores ganan experiencia al derrotar enemigos y acumulan oro para comprar elementos que fortalezcan a sus campeones. Con un enfoque en la estrategia y la coordinación de equipo, League of Legends ofrece una experiencia de juego dinámica y desafiante."]
    },
    {
        "tag": "modos",
        "patterns": ["que modos de juego tiene league of legends", "cuales son los modos de juego en league of legends", "puedes decirme los modos de juego de league of legends", "que opciones de juego hay en league of legends", "como son los diferentes modos de juego en league of legends", "dime los tipos de juego que tiene league of legends", "que tipos de partida se pueden jugar en league of legends", "me puedes explicar los modos de juego disponibles en league of legends", "cuales son las modalidades de juego en league of legends", "explícame que variedades de juego ofrece league of legends"],
        "responses": ["El modo principal, La Grieta del Invocador, donde dos equipos de cinco jugadores luchan por destruir el 'nexo' enemigo mientras defienden el suyo. La escala competitiva clasificada asigna a los jugadores un rango inicial que pueden ascender a través del sistema de emparejamiento. Además, hay modos permanentes como ARAM (All Random, All Mid), donde los jugadores se enfrentan en un mapa con un solo carril, y Teamfight Tactics, un auto battler donde los jugadores compiten para ser el último en pie colocando unidades en un tablero. Además de estos modos permanentes, League of Legends presenta modos temporales alineados con eventos del juego, como Fuego Ultra Rápido (URF), Uno Para Todos y Bombardeo al Nexo, que ofrecen experiencias únicas y divertidas para los jugadores."]
    },
    {
        "tag": "como_se_juega",
        "patterns": ["como se juega a league of legends", "como se juega", "cual es la forma de jugar", "como se juega al lol"],
        "responses": ["League of Legends es un juego en línea donde dos equipos compiten para destruir la base del equipo enemigo. Cada jugador controla un campeón, un poderoso personaje con habilidades únicas. Usando el teclado, te mueves con las teclas de dirección y usas habilidades con las teclas Q, W, E y R. El ratón se usa para dirigir ataques y movimientos. Enfrentas a oponentes en tres 'caminos' principales, defendidos por torres y monstruos. Matas monstruos para ganar oro y experiencia, mejorando a tu campeón. Trabajas con tu equipo para derrotar a los enemigos, tomar objetivos como dragones y barrones, y finalmente destruir la base enemiga para ganar la partida."]
    },
    {
        "tag": "grieta_del_invocador",
        "patterns": ["que es la grieta del invocador", "cual es el modo de juego principal", "a que te referis con grieta del invocador", "modo principal", "como es la grieta del invocador", "cual es el modo de juego principal", "como es el modo de juego principal"],
        "responses": ["La Grieta del Invocador es el mapa principal de League of Legends, donde se desarrolla la mayorzía de las partidas. Se compone de tres 'caminos' principales, llamados top, mid y bot, conectados por una jungla. Cada equipo tiene una base en un extremo del mapa, protegida por torres y defensas. El objetivo es destruir la base enemiga. Los jugadores controlan un campeón y luchan contra los campeones enemigos y monstruos neutrales usando habilidades y ataques básicos. Utilizas el teclado para moverte y lanzar habilidades, y el ratón para apuntar y atacar. Además de combatir, los jugadores deben recolectar oro, comprar objetos para mejorar a su campeón y colaborar con su equipo para obtener ventaja sobre el enemigo. Ganar la partida requiere estrategia, coordinación y habilidad individual."]
    },
    {
        "tag": "roles",
        "patterns": ["cuales son los roles de league of legends", "como son los roles", "que roles hay", "roles", "a que te referis con roles"],
        "responses": ["En League of Legends, hay cinco roles principales que los jugadores pueden asumir: Top, Jungla, Mid, ADC (Attack Damage Carry) y Support. Cada rol tiene tareas específicas y se desempeña en diferentes partes del mapa"]
    },
    {
        "tag": "top",
        "patterns": ["cual es el rol del toplaner", "top", "toplaner","toplane", "top-laner", "como se juega top", "como jugar top", "que hace el toplaner", "como jugar toplane", "cual es el rol del toplaner", "cual es el rol del top"],
        "responses": ["El toplaner despliega su habilidad en el carril superior de la Grieta del Invocador, donde se enfrenta directamente a un solo oponente en la mayoría de los casos. Este rol exige una combinación única de resistencia, capacidad de pelea y adaptabilidad. Los toplaners suelen ser campeones robustos con habilidades que les permiten sobrevivir y comerciar eficazmente. Su objetivo principal es controlar el carril superior, asegurando tanto el dominio individual como la presión constante sobre las torres enemigas. A medida que progresa el juego, el toplaner debe tomar decisiones críticas sobre cuándo unirse a su equipo en peleas grupales o si es mejor continuar aplicando presión en su carril. Esta elección depende de factores como el estado del juego, la composición del equipo y las oportunidades para dividir al equipo enemigo. En resumen, el toplaner es un pilar fundamental en la estrategia del equipo, desempeñando un papel versátil que abarca desde el combate individual hasta la colaboración en equipo."]
    },
    {
        "tag": "jungla",
        "patterns": ["cual es el rol del jungla", "jungla", "jungler", "como se juega jungla", "como jugar jungla", "que hace el jungla", "como jugar jungla", "cual es el rol del jungla"],
        "responses": ["El jungla en League of Legends es un rol crucial que opera en la jungla, un área neutral entre los carriles. Este jugador tiene la tarea de derrotar a los monstruos de la jungla para obtener oro y experiencia, así como de realizar 'ganks' o emboscadas en los carriles para ayudar a sus compañeros de equipo a conseguir ventaja. Además, el jungla es responsable de controlar objetivos neutrales como los dragones y los barones, y de proporcionar visión del mapa mediante la colocación de wards. Su versatilidad y movilidad le permiten adaptarse dinámicamente a las necesidades del equipo, ya sea ayudando a asegurar kills, proteger torres o facilitar el control del mapa. En resumen, el jungla desempeña un papel estratégico fundamental en el equipo, influyendo en el ritmo y el resultado del juego mediante su capacidad para presionar y controlar diferentes áreas del mapa."]
    },
    {
        "tag": "mid",
        "patterns": ["cual es el rol del mid", "mid", "midlaner", "como se juega mid", "como jugar mid", "que hace el mid", "como jugar mid", "cual es el rol del mid", "cual es el rol del midlaner"],
        "responses": ["El midlaner en League of Legends es un rol esencial que domina el carril central del mapa, conocido como 'mid'. Este jugador se destaca por su capacidad para infligir daño significativo o proporcionar utilidad crucial durante todas las etapas del juego. El midlaner suele ser un campeón con habilidades de alto impacto, lo que le permite controlar el carril y establecer la dinámica del juego. Su objetivo principal es asegurar el control del carril medio, lo que implica ganar trades con el oponente, farmear oro y experiencia de manera eficiente, y mantener la presión en el mapa. Además, el midlaner tiene la capacidad única de hacer roaming hacia otros carriles para ayudar a sus compañeros de equipo o asegurar objetivos importantes, como dragones y torres. Durante las peleas grupales, el midlaner a menudo asume el papel de daño principal o de control de masas, buscando eliminar a los carries enemigos o proteger a sus aliados clave. En resumen, el midlaner es un componente vital del equipo, encargado de establecer la ventaja temprana, mantener la presión en el mapa y llevar el juego hacia la victoria a través de su habilidad y destreza en el carril central."]
    },
    {
        "tag": "adc",
        "patterns": ["cual es el rol del adc", "adcarry", "adc", "como se juega adc", "como jugar adc", "que hace el adc", "como jugar adc", "cual es el rol del adc", "cual es el rol del adc"],
        "responses": ["El ADC (Attack Damage Carry) en League of Legends es un rol fundamental que se desempeña en el carril inferior del mapa, junto con el soporte. Este jugador se caracteriza por su capacidad para infligir daño a distancia y para llevar al equipo hacia la victoria en las etapas finales del juego. El ADC suele ser un campeón de ataque físico que depende en gran medida de acumular oro y objetos para maximizar su potencial de daño. Durante la fase temprana del juego, el ADC se enfoca en farmear de manera segura, asegurando el máximo de oro posible para comprar los objetos necesarios. Una vez que avanza el juego, el ADC se convierte en la principal fuente de daño del equipo durante las peleas grupales y los enfrentamientos en equipo. Su objetivo es mantenerse protegido mientras inflige daño a los enemigos, priorizando a los carries enemigos y ayudando a asegurar objetivos clave, como torres, dragones y el barón Nashor. La posición y el posicionamiento son fundamentales para el ADC, ya que incluso un pequeño error puede resultar en su muerte y en una pérdida de ventaja para el equipo. En resumen, el ADC es el pilar del equipo en términos de daño y contribuye significativamente al éxito del equipo en las etapas finales del juego a través de su habilidad para infligir daño constante y decisivo a los enemigos."]
    },
    {
        "tag": "support",
        "patterns": ["cual es el rol del support", "support", "soporte", "como se juega support", "como jugar support", "que hace el support", "como jugar support", "cual es el rol del support", "cual es el rol del support"],
        "responses": ["El support en League of Legends es un rol crucial que acompaña al ADC en el carril inferior del mapa. Aunque el support no es el principal responsable del daño, su función es esencial para el éxito del equipo. El support se enfoca en proporcionar utilidad, protección y control de la visión para su equipo. Durante la fase temprana del juego, el support ayuda al ADC a farmear de manera segura y a mantener el control del carril, mientras también se encarga de protegerlo de los ataques enemigos y de facilitar oportunidades para asegurar kills. Además, el support es responsable de colocar wards en puntos estratégicos del mapa para proporcionar visión y controlar la información sobre los movimientos del equipo enemigo. Durante las peleas grupales, el support desempeña un papel vital al proporcionar control de masas, curación y protección a los aliados, así como al deshabilitar a los enemigos clave. La elección de campeones de support puede variar desde aquellos con habilidades de curación y escudo hasta aquellos con control de masas y capacidades de iniciación. En resumen, el support es el pilar de apoyo del equipo, encargado de facilitar el éxito del ADC y del equipo en general mediante la provisión de utilidad, protección y control de la visión en todas las etapas del juego."]
    },
    {
        "tag": "tiempo_de_partida",
        "patterns":["cuanto dura una partida", "cual es el tiempo de una partida", "cuanto puede llegar a durar una partida", "duracion de la partida promedio", "cuanto se tarda una partida"],
        "responses":["La duración promedio de una partida de League of Legends puede variar considerablemente dependiendo de varios factores, como el nivel de habilidad de los jugadores, la composición de los equipos, la estrategia empleada y la dinámica del juego. Sin embargo, en general, una partida promedio suele durar entre 20 y 40 minutos. Algunas partidas pueden terminar en menos de 20 minutos si un equipo domina rápidamente, mientras que otras pueden extenderse más allá de los 40 minutos, especialmente si ambos equipos están igualados o si hay una estrategia de defensa prolongada por parte de uno de los equipos."] 
    },
    {
        "tag": "tipos_de_personaje",
        "patterns": ["cuantos tipos de personajes hay", "que tipos de personajes hay", "como son los personajes", "que personajes hay", "como son los campeones", "que campeones hay", "personajes", "campeones", "tipos de personajes"],
        "responses": ["En League of Legends, los campeones se agrupan en varios tipos según sus roles y habilidades principales. \n Los asesinos son expertos en eliminar rápidamente a objetivos específicos con ráfagas de daño elevadas, siendo efectivos para desbaratar al equipo enemigo al eliminar a los carries enemigos clave. Los luchadores, por otro lado, son versátiles en el combate cuerpo a cuerpo, combinando daño y resistencia para mantenerse en la pelea durante periodos prolongados y ofrecer una amenaza constante para el equipo contrario. Los tanques ocupan la primera línea de batalla, destacando por su gran cantidad de salud y resistencia para absorber el daño enemigo y proteger a su equipo, siendo fundamentales para iniciar peleas y proteger a los aliados más vulnerables. \n Los tiradores, o ADCs (Ataque a Distancia), son campeones de daño físico que, desde la retaguardia, infligen daño constante a los enemigos, especialmente importantes en la destrucción de estructuras como torres y en el daño sostenido durante las peleas grupales.\n Los magos, por otro lado, utilizan habilidades mágicas para infligir daño a sus enemigos, generalmente con efectos de área o de largo alcance, siendo efectivos para debilitar a múltiples enemigos simultáneamente.\n Finalmente, los soportes se centran en brindar utilidad y protección a su equipo, con habilidades de curación, escudos y control de masas para ayudar a sus aliados a sobrevivir y destacar en combate."]
    },
    {
        "tag": "historia",
        "patterns": ["cual es la historia", "como es la historia", "historia", "lore", "como es el lore", "cual es la historia de league of legends", "explica la historia", "explica el lore"],
        "responses": ["La historia de League of Legends se desarrolla en el vasto y diverso continente de Runaterra, un mundo impregnado de magia, donde conviven humanos, vastayas, yordles y otras criaturas místicas. En este escenario, la Guerra Rúnica fue un evento crucial que marcó profundamente la historia del mundo, con poderosos magos luchando por el control de las misteriosas runas. Para evitar futuros conflictos catastróficos, se creó el Instituto de la Guerra, una institución que organiza enfrentamientos controlados en la Grieta del Invocador, donde los campeones, figuras legendarias con habilidades únicas y motivaciones diversas, representan a diferentes facciones, regiones y culturas en la búsqueda de la supremacía.\n A lo largo de los años, el universo de League of Legends se ha expandido a través de eventos y actualizaciones que han agregado profundidad al lore del juego. Desde la oscura presencia de la Sombra de las Islas de las Sombras hasta la conquista de Noxus sobre vastas regiones, cada parte del mundo de Runaterra tiene su propia historia, mitos y leyendas que contribuyen a la rica tapestry de su historia. Los campeones, ya sean héroes venerados o villanos infames, representan el corazón de esta narrativa, y sus interacciones y conflictos moldean continuamente el destino del continente. Así, la historia de League of Legends es un fascinante relato de mitos, leyendas y luchas por el poder en un mundo lleno de magia y maravillas."]
    }
]

}